ASSIGNMENT:

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

A1. Code is below:

In [2]:
# Importing Pandas library

import pandas as pd

In [3]:
# Creating a series named 'ser' by given values.

ser = pd.Series([4, 8, 15, 16, 23, 42])

In [4]:
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
# Printing the series.

print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

A2. Code is below

In [6]:
# Create a list of length 10.

l = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

In [7]:
# Creating a series named 'ser1' by the list created.

ser1 = pd.Series(l)

In [8]:
ser1

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [9]:
# Printing the series.

print(ser1)

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

A3. Code is below:

In [10]:
# Step1: Create a list of data where its elements are row-vice data to insert in a dataframe

data = [['Alice', 25, 'Female'], ['Bob', 30, 'Male'], ['Claire', 27, 'Female']]

In [11]:
# Step2: Creating a dataframe, passing the data and column names as list

df = pd.DataFrame(data, columns = ['Name', 'Age', 'Gender'])

In [12]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
# Printing the dataframe

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A4. DataFrame:

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.We can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.

-> How DataFrame is different from Pandas.series:-

A Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column.
1)Series are 1-D, whereas Dataframe are 2-D.
2)Series consists of homogeneous data, whereas dataframe consists of heterogeneous data.
3)series are value mutable whereas dataframe are not.
4)For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.

In [14]:
# Example: From the above datafram in ANS3, we have

df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [15]:
# Here, df['Name'] is a Series

type(df['Name'])

pandas.core.series.Series

In [16]:
df[['Name']]

     Name
0   Alice
1     Bob
2  Claire

In [17]:
# Here, df[['Name']] is a DataFrame

type(df[['Name']])

pandas.core.frame.DataFrame

In [18]:
# Here, df is a DataFrame

type(df)

pandas.core.frame.DataFrame

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

A5. There are many functions available to manipulate data in a Pandas Dataframe. Let's take a dataset :-

In [19]:
df1 = pd.read_csv("players_data.csv")

In [20]:
df1

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [21]:
# To display first 5 rows:

df1.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035

In [27]:
# To display the last 5 rows:

df1.tail()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [23]:
# To display the number of rows and columns of the dataset df1:

df1.shape

(675, 30)

In [24]:
# To display the datatypes in the df1:

df1.dtypes

Rk        object
Player    object
Pos       object
Age       object
Tm        object
G         object
GS        object
MP        object
FG        object
FGA       object
FG%       object
3P        object
3PA       object
3P%       object
2P        object
2PA       object
2P%       object
eFG%      object
FT        object
FTA       object
FT%       object
ORB       object
DRB       object
TRB       object
AST       object
STL       object
BLK       object
TOV       object
PF        object
PTS       object
dtype: object

In [25]:
# To display the column names:

df1.columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [28]:
# To display one column only:

df1['Tm']

0      NYK
1      MEM
2      OKC
3      MIN
4      TOT
      ...
670    TOT
671    MIN
672    BRK
673    CHO
674    BOS
Name: Tm, Length: 675, dtype: object

In [29]:
# Slicing in Dataframe:

df1[0:3]

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537

In [30]:
# To display a specific matrix in dataframe:

df1.iloc[0:2, [0,1,2]]

  Rk        Player Pos
0  1    Quincy Acy  PF
1  2  Jordan Adams  SG

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

A6. In terms of data, all three Series, DataFrame and Panel are mutable. 
    But in terms of size, Series are immutable whereas DataFrame and Panel are mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

A7. Code is below

In [38]:
# Creating 3 lists

author = ['Monika', 'Antoneitte', 'Cassandra', 'Zeus']
age = [23, 27, 34, 18]
country = ['India' , 'Iceland', 'USA', 'Australia']

In [39]:
# Creating 3 Series out of these 3 lists

auth_ser = pd.Series(author)
age_ser = pd.Series(age)
coun_ser = pd.Series(country)

In [43]:
# Creating a dictionary by passing 3Series objects as values as Column names as keys

dic = {'Author': auth_ser, 'Age': age_ser, 'Country' : coun_ser}

In [41]:
# Creating a dataframe by passing the dictionary 

df2 = pd.DataFrame(dic)

In [42]:
df2

       Author  Age    Country
0      Monika   23      India
1  Antoneitte   27    Iceland
2   Cassandra   34        USA
3        Zeus   18  Australia

In [44]:
# Here, we created a dataframe using 3 differen series